{
  "basics": {
    "name": "Peter Schoeffman",
    "label": "CSA",
    "picture": "http://schoeffman.com/images/me.jpg",
    "email": "schoeffman@gmail.com",
    "phone": "",
    "website": "http://schoeffman.com",
    "summary": "I solve business problems using technology. I serve as an agent of change where improvement is required. I design and implement systems to make change, so I can train and motivate others.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "San Francisco",
      "countryCode": "US",
      "region": "California"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "@schoeffman",
        "url": "https://twitter.com/schoeffman"
      },
      {
        "network": "Link",
        "username": "schoeffman",
        "url": "https://www.linkedin.com/in/schoeffman"
      },
      {
        "network": "Stack Overflow",
        "username": "schoeffman",
        "url": "http://stackoverflow.com/users/2120237/schoeffman"
      }
    ]
  },
  "work": [
    {
      "company": "Springshot",
      "position": "CSA",
      "website": "http://springshot.com/",
      "startDate": "2015-06-12",
      "endDate": "",
      "summary": "Springshot is a workforce management solution providing next generation cloud technology to those in need. Built on Ruby on Rails, and Angularjs I faced, many challenges as a CSA. Here is where I learned to see the big picture, make many pieces of a large system work together, and provide great solutions.",
      "highlights": [
        "Design new front-end architecture for our next generation task management system.",
        "Research and evaluate new front-end tools and emerging technologies to decide if using them can improve the organization's technology platforms.",
        "Conduct testing to ensure that the systems work as expected. "
      ]
    },
    {
      "company": "The Toronto Star",
      "position": "Full Stack Developer",
      "website": "http://www.thestar.com/",
      "startDate": "2012-11-01",
      "endDate": "2015-06-11",
      "summary": "Built on top of a Adobe AudienceManager backend, The Star has both an AEM frontend, and a mobile Angular app. A model for other news papers The Star strives to remain on top of its technological game.",
      "highlights": [
        "Built from ontop of a Adobe AudienceManager backend, The Star has both an AEM frontend, and a mobile Angular app. A model for other news papers The Star strives to remain on top of its technological game.",
        "Manage The Grid Toronto Network and create digital strategy.",
        "Setup Servers and infrastructure using Amazon AWS for TorStar.",
        "Work in Agile cycle to estimate on on going work and constantly improve all elements of the process."
      ]
    },
    {
      "company": "Student Life Network",
      "position": "Full Stack Developer",
      "website": "https://studentlifenetwork.com",
      "startDate": "2010-06-01",
      "endDate": "2012-10-31",
      "summary": "During my time at SLN the company focused on providing universities private social networks tailored to their needs. We created all sorts of innovative and interesting tools to help tight nite school based communities grow.    ",
      "highlights": [
        "- Project lead for public facing website Network",
        "- Build and maintain features for core technology",
        "- Introduce and run Web Games project"
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Humber College Club",
      "position": "President of Game Programming",
      "website": "http://www.humber.ca/",
      "startDate": "2008-09-21",
      "endDate": "2010-06-30",
      "summary": "To provide the student body a meeting ground to explore game development. To work together on group projects for fun, to host code challenges, and hack away.",
      "highlights": [
        "2009 Humber Programming Classic",
        "2010 Humber Programming Classic"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Stanford",
      "area": "Stanford Strategic Decision and Risk Management",
      "studyType": "Certificate ",
      "startDate": "2015",
      "endDate": "2016",
      "gpa": "N/A",
      "courses": []
    },
    {
      "institution": "Humber College",
      "area": "Game Programming",
      "studyType": "Advanced Diploma ",
      "startDate": "2007",
      "endDate": "2010",
      "gpa": "Honours",
      "courses": []
    },
    {
      "institution": "Sheridan College",
      "area": "Media Fundamentals",
      "studyType": "Certificate ",
      "startDate": "2006",
      "endDate": "2007",
      "gpa": "N/A",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Languages",
      "level": "Mixed",
      "keywords": [
        "HTML",
        "CSS",
        "Javascript",
        "Java",
        "PHP",
        "Ruby",
        "C++",
        "C#"
      ]
    },
    {
      "name": "Frameworks",
      "level": "Mixed",
      "keywords": [
        "Rails",
        "AEM",
        "Angular",
        "React",
        "MySQL",
        "PostgreSQL",
        "Node",
        "Cordova"
      ]
    },
    {
      "name": "Misc",
      "level": "Mixed",
      "keywords": [
        "Bash",
        "Vagrant",
        "Varnish",
        "Git",
        "AWS"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [],
  "references": [
    {
      "name": "Stephen Evans",
      "reference": "Pete is a talented young developer who has demonstrated huge potential and increasing leadership over the two years I worked with him. He has that rare combination of technical ability and people skills that will serve him well for years to come. His recruitment to the Toronto Star was a real \"find\" from a hiring perspective."
    },
    {
      "name": " Matthew Hogg",
      "reference": "Peter is a smart and inquisitive developer who is always ready to learn new tricks and capture them immediately. He's not afraid of accepting new roles and responsibilities and he's unflappable – he has always remained calm in any situation and can perform under pressure. He approaches every day and task with a healthy sense of humour and relaxed composure that benefits the entire team.   I've had the pleasure of working with Peter on 2 occasions now and wouldn't hesitate to do so again"
    },
    {
      "name": "Zenon Harley",
      "reference": "Peter's attitude towards coding is relentless and fearless, with an appetite for acquiring new skills and discovering better ways of getting it done. Having worked with Peter in many time-sensitive crunch situations, he never taps out early or makes excuses, but rather takes responsibility above and beyond expectations. In addition to a strong coding ability and laudable work ethic, his magnetic personality is an asset to any team and a catalyst for creativity and open discussion. I recommend Peter without reservation."
    }
  ]
}
